app/controllers/clubs_controller.rb

  def index
    @clubs = Club.all
---
SELECT * FROM "clubs"

  def show
    @club = Club.find(params[:id])
---
SELECT * FROM "clubs" WHERE ("clubs"."id" = 1)

  def create
    @club = Club.new(params[:club])
    if @club.save
---
INSERT INTO "clubs" ("name", "club_icon_updated_at", "created_at", "creation_date", "updated_at", "club_icon_file_size", "club_icon_file_name", "club_icon_content_type", "teams_count") VALUES(E'Jeanne d''arc de dakar', '2009-09-05 05:02:38.337263', '2009-09-05 05:02:44.859053', '2009-09-05', '2009-09-05 05:02:44.859053', 12049, E'Papier_peint_de_la_Galerie_de_photos_Windows.jpg', E'image/jpeg', 0) RETURNING "id"

  def edit
    @club = Club.find(params[:id])
---
SELECT * FROM "clubs" WHERE ("clubs"."id" = 1)

  def update
    @club = Club.find(params[:id])
    if @club.update_attributes(params[:club])
---
SELECT * FROM "clubs" WHERE ("clubs"."id" = 1)
UPDATE "clubs" SET "club_icon_file_size" = 12049, "updated_at" = '2009-09-04 23:06:51.732622', "club_icon_updated_at" = '2009-09-04 23:06:42.791482', "club_icon_content_type" = E'image/jpeg', "club_icon_file_name" = E'Papier_peint_de_la_Galerie_de_photos_Windows.jpg' WHERE "id" = 1

  def destroy
    @club = Club.find(params[:id])
    @club.destroy
---
SELECT * FROM "clubs" WHERE ("clubs"."id" = 1)
DELETE FROM "clubs" WHERE "id" = 1