app/controllers/players_controller.rb

  def index
    @players = Player.all
---
SELECT * FROM "players"

  def show
    @player = Player.find(params[:id])
---
SELECT * FROM "players" WHERE ("players"."id" = 1)

  def create
    @player = Player.new(params[:player])
    if @player.save
---
INSERT INTO "players" ("created_at", "birthdate", "updated_at", "lastname", "firstname", "position_id", "player_icon_file_name", "player_icon_file_size", "player_icon_updated_at", "player_icon_content_type") VALUES('2009-09-07 16:36:18.736404', '2009-09-07', '2009-09-07 16:36:18.736404', E'Beckam', E'David ', NULL, E'Papier_peint_de_la_Galerie_de_photos_Windows.jpg', 12049, '2009-09-07 16:36:16.030590', E'image/jpeg') RETURNING "id"

  def edit
    @player = Player.find(params[:id])
---
SELECT * FROM "players" WHERE ("players"."id" = 1)

  def update
    @player = Player.find(params[:id])
    if @player.update_attributes(params[:player])
---
SELECT * FROM "players" WHERE ("players"."id" = 1)
UPDATE "players" SET "updated_at" = '2009-09-07 16:19:56.239210', "player_icon_updated_at" = '2009-09-07 16:19:50.605163', "player_icon_content_type" = E'image/jpeg', "player_icon_file_size" = 12049, "player_icon_file_name" = E'Papier_peint_de_la_Galerie_de_photos_Windows.jpg' WHERE "id" = 1

  def destroy
    @player = Player.find(params[:id])
    @player.destroy
---
SELECT * FROM "players" WHERE ("players"."id" = 3)
DELETE FROM "players" WHERE "id" = 3

	def load_positions
		@positions = Position.all
---
SELECT * FROM "positions"