app/controllers/positions_controller.rb

SELECT * FROM "positions"
---
  def index
    @positions = Position.all

SELECT * FROM "positions" WHERE ("positions"."id" = 1)
---
  def show
    @position = Position.find(params[:id])

INSERT INTO "positions" ("name", "created_at", "updated_at", "players_count") VALUES(E'gardien de buts', '2009-09-08 00:23:10.933381', '2009-09-08 00:23:10.933381', NULL) RETURNING "id"
---
  def create
    @position = Position.new(params[:position])
    if @position.save

SELECT * FROM "positions" WHERE ("positions"."id" = 3)
---
  def edit
    @position = Position.find(params[:id])

SELECT * FROM "positions" WHERE ("positions"."id" = 3)
UPDATE "positions" SET "updated_at" = '2009-09-08 00:24:17.329778', "name" = E'arriere lateral droit ' WHERE "id" = 3
---
  def update
    @position = Position.find(params[:id])
    if @position.update_attributes(params[:position])