app/controllers/team_players_controller.rb

SELECT * FROM "clubs" WHERE ("clubs"."id" = 1)
SELECT * FROM "teams" WHERE ("teams"."id" = 3 AND ("teams".club_id = 1))
---
	def load_team
		@club = Club.find params[:club_id]
		@team  = @club.teams.find params[:team_id]

SELECT * FROM "positions"
---
	def load_positions
		@positions = Position.all