app/controllers/teams_controller.rb

  def index
    @teams = @club.teams.all
---
SELECT * FROM "teams" WHERE ("teams".club_id = 1)

  def show
    @team = @club.teams.find(params[:id])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 4 AND ("teams".club_id = 1))

  def create
    @team = @club.teams.build(params[:team])
    if @team.save
---
INSERT INTO "teams" ("name", "team_icon_updated_at", "created_at", "team_icon_file_name", "team_icon_file_size", "teamcategory_id", "updated_at", "club_id", "team_icon_content_type") VALUES(E'Espoirs et Equipe B', '2009-09-08 18:31:50.679786', '2009-09-08 18:31:53.923850', E'Papier_peint_de_la_Galerie_de_photos_Windows.jpg', 12049, 1, '2009-09-08 18:31:53.923850', 1, E'image/jpeg') RETURNING "id"

  def edit
    @team = @club.teams.find(params[:id])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 4 AND ("teams".club_id = 1))

  def update
    @team = @club.teams.find(params[:id])
    if @team.update_attributes(params[:team])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 4 AND ("teams".club_id = 1))
UPDATE "teams" SET "updated_at" = '2009-09-08 19:16:58.828683', "teamcategory_id" = 2 WHERE "id" = 3

  def destroy
    @team = @club.teams.find(params[:id])
    @team.destroy
---
SELECT * FROM "teams" WHERE ("teams"."id" = 3 AND ("teams".club_id = 1))
DELETE FROM "teams" WHERE "id" = 3

	def load_club
		@club = Club.find(params[:club_id])
---
SELECT * FROM "clubs" WHERE ("clubs"."id" = 2)

	def load_categories
		@categories = Teamcategory.all
---
SELECT * FROM "teamcategories"