app/controllers/teamcategories_controller.rb

  def index
    @teamcategories = Teamcategory.all
---
SELECT * FROM "teamcategories"

  def show
    @teamcategory = Teamcategory.find(params[:id])
---
SELECT * FROM "teamcategories" WHERE ("teamcategories"."id" = 1)

  def create
    @teamcategory = Teamcategory.new(params[:teamcategory])
    if @teamcategory.save
---
INSERT INTO "teamcategories" ("name", "created_at", "updated_at", "teams_count") VALUES(E'juniors', '2009-09-06 05:38:01.578451', '2009-09-06 05:38:01.578451', NULL) RETURNING "id"